<?php

use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Schema;

return new class extends Migration
{
    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        Schema::create('areas', function (Blueprint $table) {
            $table->id();
            $table->string('title')->nullable();
            $table->string('lat');
            $table->string('lng');
            $table->timestamps();
        });
        DB::table('areas')->insert([
            ['title' => 'สวนรุกขชาติห้วยแก้ว', 'lat' => '18.8104197', 'lng' => '98.94902'],
            ['title' => 'สวนรุกขชาติห้วยแก้ว', 'lat' => '18.8099322', 'lng' => '98.9488912'],
            ['title' => 'สวนรุกขชาติห้วยแก้ว', 'lat' => '18.8093838', 'lng' => '98.9490414'],
            ['title' => 'สวนรุกขชาติห้วยแก้ว', 'lat' => '18.8093635', 'lng' => '98.9498354'],
            ['title' => 'สวนรุกขชาติห้วยแก้ว', 'lat' => '18.8087338', 'lng' => '98.9502645'],
            ['title' => 'สวนรุกขชาติห้วยแก้ว', 'lat' => '18.8085307', 'lng' => '98.9508439'],
            ['title' => 'สวนรุกขชาติห้วยแก้ว', 'lat' => '18.8091807', 'lng' => '98.9528394'],
            ['title' => 'สวนรุกขชาติห้วยแก้ว', 'lat' => '18.8099119', 'lng' => '98.9509512'],
            ['title' => 'สวนรุกขชาติห้วยแก้ว', 'lat' => '18.8102978', 'lng' => '98.9498139'],
            ['title' => 'สวนรุกขชาติห้วยแก้ว', 'lat' => '18.8104197', 'lng' => '98.94902'],
            ['title' => 'อ่างแก้ว', 'lat' => '18.8086455', 'lng' => '98.9497068'],
            ['title' => 'อ่างแก้ว', 'lat' => '18.8084805', 'lng' => '98.9494574'],
            ['title' => 'อ่างแก้ว', 'lat' => '18.808092', 'lng' => '98.9493366'],
            ['title' => 'อ่างแก้ว', 'lat' => '18.8076121', 'lng' => '98.9493018'],
            ['title' => 'อ่างแก้ว', 'lat' => '18.807376', 'lng' => '98.9495244'],
            ['title' => 'อ่างแก้ว', 'lat' => '18.8073456', 'lng' => '98.9491167'],
            ['title' => 'อ่างแก้ว', 'lat' => '18.8066753', 'lng' => '98.9486661'],
            ['title' => 'อ่างแก้ว', 'lat' => '18.8061878', 'lng' => '98.9482262'],
            ['title' => 'อ่างแก้ว', 'lat' => '18.8051519', 'lng' => '98.9500608'],
            ['title' => 'อ่างแก้ว', 'lat' => '18.8057511', 'lng' => '98.9509084'],
            ['title' => 'อ่างแก้ว', 'lat' => '18.8066347', 'lng' => '98.9513054'],
            ['title' => 'อ่างแก้ว', 'lat' => '18.8074674', 'lng' => '98.9513054'],
            ['title' => 'อ่างแก้ว', 'lat' => '18.8078838', 'lng' => '98.9504578'],
            ['title' => 'อ่างแก้ว', 'lat' => '18.8076909', 'lng' => '98.9500716'],
            ['title' => 'อ่างแก้ว', 'lat' => '18.8079346', 'lng' => '98.949739'],
            ['title' => 'อ่างแก้ว', 'lat' => '18.8084627', 'lng' => '98.9499106'],
            ['title' => 'อ่างแก้ว', 'lat' => '18.8086455', 'lng' => '98.9497068'],
            ['title' => 'คณะสังคมศาสตร์ มหาวิทยาลัยเชียงใหม่', 'lat' => '18.80331813844608', 'lng' => '98.94959340279246'],
            ['title' => 'คณะสังคมศาสตร์ มหาวิทยาลัยเชียงใหม่', 'lat' => '18.80393302157357', 'lng' => '98.94906675440052'],
            ['title' => 'คณะสังคมศาสตร์ มหาวิทยาลัยเชียงใหม่', 'lat' => '18.80303083936468', 'lng' => '98.94867350421643'],
            ['title' => 'คณะสังคมศาสตร์ มหาวิทยาลัยเชียงใหม่', 'lat' => '18.80244198673066', 'lng' => '98.94852254083942'],
            ['title' => 'คณะสังคมศาสตร์ มหาวิทยาลัยเชียงใหม่', 'lat' => '18.80199389673565', 'lng' => '98.94851958356732'],
            ['title' => 'คณะสังคมศาสตร์ มหาวิทยาลัยเชียงใหม่', 'lat' => '18.80174992383299', 'lng' => '98.94855201869862'],
            ['title' => 'คณะสังคมศาสตร์ มหาวิทยาลัยเชียงใหม่', 'lat' => '18.8014143255574', 'lng' => '98.94898376153458'],
            ['title' => 'คณะสังคมศาสตร์ มหาวิทยาลัยเชียงใหม่', 'lat' => '18.80117099880309', 'lng' => '98.94978992924057'],
            ['title' => 'คณะสังคมศาสตร์ มหาวิทยาลัยเชียงใหม่', 'lat' => '18.80102608548628', 'lng' => '98.95032065846007'],
            ['title' => 'คณะสังคมศาสตร์ มหาวิทยาลัยเชียงใหม่', 'lat' => '18.80065253040767', 'lng' => '98.95112265885936'],
            ['title' => 'คณะสังคมศาสตร์ มหาวิทยาลัยเชียงใหม่', 'lat' => '18.80061678512619', 'lng' => '98.95130884889379'],
            ['title' => 'คณะสังคมศาสตร์ มหาวิทยาลัยเชียงใหม่', 'lat' => '18.80149725425877', 'lng' => '98.95120451051773'],
            ['title' => 'คณะสังคมศาสตร์ มหาวิทยาลัยเชียงใหม่', 'lat' => '18.80221102046232', 'lng' => '98.95132358758262'],
            ['title' => 'คณะสังคมศาสตร์ มหาวิทยาลัยเชียงใหม่', 'lat' => '18.80267126976644', 'lng' => '98.95144589912574'],
            ['title' => 'คณะสังคมศาสตร์ มหาวิทยาลัยเชียงใหม่', 'lat' => '18.80307209276081', 'lng' => '98.95068961283052'],
            ['title' => 'คณะสังคมศาสตร์ มหาวิทยาลัยเชียงใหม่', 'lat' => '18.80332612488363', 'lng' => '98.949783124408'],
            ['title' => 'คณะสังคมศาสตร์ มหาวิทยาลัยเชียงใหม่', 'lat' => '18.80331813844608', 'lng' => '98.94959340279246'],
        ]);
    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        Schema::dropIfExists('areas');
    }
};
